
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前言 · JavaScript高程3笔记</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="本书内容.html" />
    
    
    <link rel="prev" href="序.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../阅读计划.html">
            
                <a href="../阅读计划.html">
            
                    
                    阅读计划
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../FAQ.html">
            
                <a href="../FAQ.html">
            
                    
                    FAQ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    A1-序+前言
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="序.html">
            
                <a href="序.html">
            
                    
                    序
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.2" data-path="前言.html">
            
                <a href="前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="本书内容.html">
            
                <a href="本书内容.html">
            
                    
                    本书内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="本书结构.html">
            
                <a href="本书结构.html">
            
                    
                    本书结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="一些辅助.html">
            
                <a href="一些辅助.html">
            
                    
                    一些辅助
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../Ch01/">
            
                <a href="../Ch01/">
            
                    
                    Ch01
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../Ch01/1.1 JavaScript简史.html">
            
                <a href="../Ch01/1.1 JavaScript简史.html">
            
                    
                    JavaScript简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../Ch01/1.2 JavaScript实现.html">
            
                <a href="../Ch01/1.2 JavaScript实现.html">
            
                    
                    JavaScript实现
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../Ch01/1.2.2 DOM.html">
            
                <a href="../Ch01/1.2.2 DOM.html">
            
                    
                    DOM
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >前言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1>
<h2 id="&#x2605;javascript">&#x2605;JavaScript</h2>
<ul>
<li>&#x5F53;&#x4ECA;&#x4E16;&#x754C;&#x6700;&#x6D41;&#x884C;&#xFF08;(&#x2299;o&#x2299;)&#x2026;&#x6216;&#x8BB8;&#x5427;&#xFF01;&#xFF09;</li>
<li>&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x677E;&#x6563;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#xFF0C;&#x4E5F;&#x662F; Web &#x5F00;&#x53D1;&#x4E2D;&#x6781;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x4E00;&#x95E8;&#x8BED;&#x8A00;</li>
<li>&#x8BED;&#x6CD5;&#x548C;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x4E0E; Java &#x90FD;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x8DDF;Java&#x6CA1;&#x6709;&#x534A;&#x6BDB;&#x94B1;&#x5173;&#x7CFB;</li>
<li>&#x4E00;&#x79CD;&#x5168;&#x65B0;&#x7684;<a href="https://zh.wikipedia.org/zh-hans/&#x52A8;&#x6001;&#x8BED;&#x8A00;" target="_blank">&#x52A8;&#x6001;&#x8BED;&#x8A00;</a>&#xFF08;&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x786E;&#x5B9A;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x2026;&#x2026;&#xFF09;</li>
<li>&#x4E3B;&#x8981;&#x6D3B;&#x5728;Web &#x6D4F;&#x89C8;&#x5668;&#x4E4B;&#x4E2D;&#xFF08;<a href="https://www.zhihu.com/question/19901441" target="_blank">&#x6D4F;&#x89C8;&#x5668;&#x5916;&#x7684; Javascript &#x8FD0;&#x884C;&#x73AF;&#x5883;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;</a>&#xFF09;</li>
<li>&#x76EE;&#x6807;&#xFF1A;&#x81F4;&#x529B;&#x4E8E;&#x589E;&#x5F3A;&#x7F51;&#x7AD9;&#x548C;Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4EA4;&#x4E92;&#x6027;&#x3002;&#xFF08;Web&#x7F51;&#x7AD9;&#x548C;Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x610F;&#x601D;&#x554A;&#xFF01;&#x4E00;&#x4E2A;&#x4EE5;&#x5C55;&#x793A;&#x4E3A;&#x4E3B;&#xFF0C;&#x4E00;&#x4E2A;&#x4EE5;&#x529F;&#x80FD;&#x4E3A;&#x4E3B;&#x3002;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x4E3A;&#x5565;&#x4E0D;&#x662F;&#x4E0E;&#x7528;&#x6237;&#x7684;&#x4EA4;&#x4E92;&#xFF1F;&#x800C;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x57FA;&#x4F6C;&#x5728;&#x4EA4;&#x4E92;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x89C9;&#x5F97;&#x5E94;&#x8BE5;&#x662F;&#x4E8C;&#x8005;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x4EA4;&#x4E92;&#x6027;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x4E0D;&#x662F;&#x6211;&#x7406;&#x89E3;&#x6709;&#x95EE;&#x9898;&#xFF1F;&#x8FD8;&#x662F;&#x7FFB;&#x8BD1;&#x6709;&#x95EE;&#x9898;&#xFF1F;&#x4E3A;&#x6B64;&#x53EF;&#x4EE5;&#x6709;&#xFF1A;&#x300C;&#x81F4;&#x529B;&#x4E8E;&#x589E;&#x5F3A;&#x7F51;&#x7AD9;&#x6216;&#x8005;Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0E;&#x7528;&#x6237;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x6027;&#x300D;&#xFF09;</li>
</ul>
<h2 id="&#x2605;&#x672C;&#x4E66;&#x7684;&#x903B;&#x8F91;">&#x2605;&#x672C;&#x4E66;&#x7684;&#x903B;&#x8F91;</h2>
<p>&#x8FFD;&#x6839;&#x6EAF;&#x6E90;&#x2192;&#x261E;DOM&#x3001;Ajax</p>
<h2 id="&#x2605;&#x4F60;&#x4F1A;&#x5B66;&#x5230;&#x4EC0;&#x4E48;">&#x2605;&#x4F60;&#x4F1A;&#x5B66;&#x5230;&#x4EC0;&#x4E48;</h2>
<ul>
<li>&#x638C;&#x63E1;&#x5982;&#x4F55;&#x8FD0;&#x7528;&#x548C;&#x6269;&#x5C55;&#xFF08;&#x96BE;&#x9053;&#x662F;ES6/7/8/9&#x4E4B;&#x610F;&#xFF1F;&#xFF09;JavaScript&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x66F4;&#x597D;&#x5730;&#x6EE1;&#x8DB3;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;</li>
<li>&#x638C;&#x63E1;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5BA2;&#x6237;&#x7AEF;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x7684;&#x65E0;&#x7F1D;&#x901A;&#x4FE1;</li>
<li>&#x53CD;&#x6B63;&#x5C31;&#x662F;&#xFF1A;&#x6559;&#x4F1A;&#x4F60;&#x5728;&#x9762;&#x5BF9;&#x5404;&#x79CD;&#x5E38;&#x89C1;&#x7684; Web &#x5F00;&#x53D1;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5982;&#x4F55;&#x62FF;&#x51FA;&#x81EA;&#x5DF1;&#x7684; JavaScript &#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</li>
</ul>
<h2 id="&#x2605;qa">&#x2605;Q&amp;A</h2>
<p><strong>&#x2460;Web&#x7F51;&#x7AD9;&#x548C;Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x533A;&#x522B;&#xFF1F;</strong></p>
<p>&#x4F20;&#x9001;&#x95E8;&#xFF1A;<a href="https://zhidao.baidu.com/question/240697507.html" target="_blank">Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0E;&#x7F51;&#x7AD9;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;</a> </p>
<p>&#x5176;&#x4E2D;&#x4E00;&#x4F4D;&#x7F51;&#x53CB;xxx&#x7684;&#x603B;&#x7ED3;&#xFF1A;</p>
<blockquote>
<p>&#x4E00;&#x4E2A;web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x8BA9;&#x7528;&#x6237;&#x5B8C;&#x6210;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x4EFB;&#x52A1;&#x7684;&#x7F51;&#x7AD9;&#x3002;&#x800C;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x7F51;&#x7AD9;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x7ED9;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4FE1;&#x606F;(&#x535A;&#x5BA2;&#xFF0C;&#x65B0;&#x95FB;&#xFF0C;&#x6307;&#x5BFC;&#xFF0C;&#x7B49;)&#x3002; </p>
</blockquote>
<p>&#x5BF9;&#x4E86;&#xFF0C;xxx&#x7F51;&#x53CB;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x7535;&#x706F;&#x6CE1;&#x548C;&#x53D1;&#x7535;&#x5382;&#x7684;&#x6BD4;&#x55BB;&#xFF0C;&#x8BA9;&#x6211;&#x611F;&#x89C9;&#x5F88;&#x6709;&#x5473;&#x9053;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7528;&#x7535;&#x7684;&#x5668;&#x5177;&#xFF0C;&#x90A3;&#x4E48;&#x53D1;&#x7535;&#x5382;&#x662F;&#x5426;&#x6709;&#x5B58;&#x5728;&#x7684;&#x5FC5;&#x8981;&#x5462;&#xFF1F;&#x53EF;&#x662F;&#x6CA1;&#x6709;&#x4E86;&#x7535;&#xFF0C;&#x8FD9;&#x4E9B;&#x9700;&#x8981;&#x7535;&#x7684;&#x5668;&#x5177;&#x4E5F;&#x6CA1;&#x6709;&#x5B58;&#x5728;&#x7684;&#x5FC5;&#x8981;&#x4E86;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x5FFD;&#x89C6;&#x8FD9;&#x4E2A;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x7684;&#x80CC;&#x540E;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x4E8B;&#x513F;&#x2026;&#x2026;</p>
<p><strong>&#x2461;ES5&#x662F;&#x4EC0;&#x4E48;&#x9B3C;&#xFF1F;</strong></p>
<p>&#x89C4;&#x8303;&#xFF1F;&#x6807;&#x51C6;&#xFF1F;&#xFF08;<a href="https://zhidao.baidu.com/question/119397970.html" target="_blank">&#x89C4;&#x8303;&#x6216;&#x8005;&#x6807;&#x51C6;</a>&#x8FD9;TM&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x610F;&#x601D;&#xFF1F;&#xFF09;&#x53CD;&#x6B63;&#x6709;&#x603B;&#x7ED3;&#xFF1A;</p>
<blockquote>
<ol>
<li>&#x6807;&#x51C6;&#x3001;&#x89C4;&#x8303;&#x3001;&#x89C4;&#x7A0B;&#x90FD;&#x662F;&#x6807;&#x51C6;&#x7684;&#x4E00;&#x79CD;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#xFF0C;&#x4E60;&#x60EF;&#x4E0A;&#x7EDF;&#x79F0;&#x4E3A;&#x6807;&#x51C6; </li>
<li>&#x7B80;&#x5355;&#x5730;&#x8BF4;&#x89C4;&#x8303;&#x662F;&#x5BF9;&#x884C;&#x4E3A;&#x3001;&#x6761;&#x4EF6;&#x7684;&#x8981;&#x6C42;&#x548C;&#x89C4;&#x5B9A;&#xFF0C;&#x89C4;&#x7A0B;&#x662F;&#x5BF9;&#x8FC7;&#x7A0B;&#x7684;&#x8981;&#x6C42;&#x548C;&#x89C4;&#x5B9A;&#xFF0C;&#x6807;&#x51C6;&#x662F;&#x5BF9;&#x7ED3;&#x679C;&#xFF08;&#x6216;&#x4EA7;&#x54C1;&#xFF09;&#x7684;&#x8981;&#x6C42;&#x548C;&#x89C4;&#x5B9A;&#x3002; </li>
</ol>
</blockquote>
<p>&#x81EA;&#x6253;&#x5B66;&#x7F16;&#x7A0B;&#x4EE5;&#x6765;&#xFF0C;&#x603B;&#x559C;&#x6B22;&#x62A0;&#x5B57;&#x773C;&#xFF0C;&#x603B;&#x559C;&#x6B22;&#x9488;&#x5BF9;&#x8BED;&#x4E49;&#x6709;&#x4EA4;&#x96C6;&#x3001;&#x957F;&#x5F97;&#x5F88;&#x50CF;&#x7684;&#x8BCD;&#xFF0C;&#x5982;&#x8FD9;&#x6837;&#x7684;&#xFF1A;<a href="https://www.zhihu.com/question/32105413" target="_blank">&#x67B6;&#x6784;&#x3001;&#x6784;&#x67B6;&#x3001;&#x7ED3;&#x6784;&#x3001;&#x6846;&#x67B6;&#x4E4B;&#x95F4;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;</a></p>
<p>&#x6240;&#x4EE5;&#x628A;ES&#x79F0;&#x4E3A;&#x6807;&#x51C6;&#x5427;&#xFF01;&#x90A3;&#x4E48;ES5&#xFF0C;&#x5C31;&#x662F;&#x6807;&#x51C6;&#x7684;&#x7B2C;5&#x4E2A;&#x7248;&#x672C;&#x54AF;&#xFF01;&#x8BE6;&#x60C5;&#x53C2;&#x8003;&#xFF1A;<a href="https://huangxuan.me/2015/09/22/js-version/" target="_blank">ES5, ES6, ES2016, ES.Next: JavaScript &#x7684;&#x7248;&#x672C;&#x662F;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF1F;</a></p>
<p><strong>&#x2462;&#x4EA4;&#x4E92;&#x6027;&#xFF1F;</strong></p>
<p>&#x4F20;&#x9001;&#x95E8;&#xFF1A;<a href="https://baike.baidu.com/item/%E4%BA%A4%E4%BA%92%E6%80%A7" target="_blank">&#x4EA4;&#x4E92;&#x6027;</a> &#x3001;<a href="https://zh.wikipedia.org/wiki/%E4%BA%A4%E4%BA%92%E8%AE%BE%E8%AE%A1" target="_blank">&#x4EA4;&#x4E92;&#x8BBE;&#x8BA1;</a></p>
<p>&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x7684;&#x6982;&#x5FF5;&#x6CA1;&#x6709;&#x5B9A;&#x6027;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x9886;&#x57DF;&#x91CC;&#x5176;&#x542B;&#x4E49;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;&#x5F53;&#x7136;&#x300C;&#x4EA4;&#x4E92;&#x6027;&#x4E3B;&#x8981;&#x8FD0;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x53CA;&#x591A;&#x5A92;&#x4F53;&#x9886;&#x57DF; &#x300D;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x6709;&#x5176;&#x542B;&#x4E49;&#x4E3A;&#xFF1A;</p>
<blockquote>
<p>&#x4EA4;&#x4E92;&#x6027;&#x5373;&#x5F53;&#x4F60;&#x70B9;&#x51FB;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x65F6;&#x5230;&#x8FBE;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x9875;&#x9762; </p>
</blockquote>
<p>&#x5F53;&#x6211;&#x70B9;&#x51FB;&#x4E0A;&#x9762;&#x90A3;&#x4E24;&#x4E2A;&#x94FE;&#x63A5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x8DF3;&#x8F6C;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x4E86;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x4EBA;&#x673A;&#x4EA4;&#x4E92;&#x7684;&#x57FA;&#x7840;&#x65B9;&#x5F0F;&#xFF1A;</p>
<blockquote>
<p>&#x4EA4;&#x4E92;&#x8FC7;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;<strong>&#x4EBA;</strong>&#x901A;&#x8FC7;<strong>&#x4EBA;&#x673A;&#x754C;&#x9762;</strong>&#x5411;<strong>&#x8BA1;&#x7B97;&#x673A;</strong>&#x8F93;&#x5165;&#x6307;&#x4EE4;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x7ECF;&#x8FC7;&#x5904;&#x7406;&#x540E;&#x628A;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#x3002;&#x4EBA;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x5F62;&#x5F0F;&#x662F;&#x591A;&#x79CD;&#x591A;&#x6837;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4EA4;&#x4E92;&#x7684;&#x5F62;&#x5F0F;&#x4E5F;&#x662F;&#x591A;&#x6837;&#x5316;&#x7684;&#x3002; </p>
</blockquote>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6211;&#x8F93;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x300C;&#x70B9;&#x51FB;&#x300D;&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x673A;&#x6216;&#x8005;&#x5177;&#x4F53;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x8F93;&#x51FA;&#x7684;&#x662F;&#x300C;&#x65B0;&#x5F00;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x65B0;&#x9875;&#x9762;&#x300D;&#x3002;&#x7531;&#x4E8E;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x90FD;&#x662F;&#x591A;&#x6837;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8BF8;&#x5982;&#x7528;&#x6237;&#x300C;&#x56DE;&#x8F66;&#x300D;&#x300C;&#x6EDA;&#x52A8;&#x300D;&#x300C;&#x9F20;&#x6807;&#x60AC;&#x505C;&#x300D;&#x7B49;&#x8F93;&#x5165;&#x6307;&#x4EE4;&#xFF0C;&#x4E3A;&#x6B64;&#x5BF9;&#x5E94;&#x7684;&#x8F93;&#x51FA;&#x4E5F;&#x662F;&#x5404;&#x6709;&#x5404;&#x7684;&#x82B1;&#x62DB;&#x4E86;&#x2026;&#x2026;</p>
<p>ps&#xFF1A;&#x4EA4;&#x4E92;&#x662F;&#x4E92;&#x901A;&#x7684;&#x3001;&#x53CC;&#x5411;&#x7684;&#x3001;&lt;=&gt;&#x7684;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x53EF;&#x4EE5;&#x5F53;&#x4F5C;&#x662F;&#x7528;&#x6237;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x4F5C;&#x7528;&#x5BF9;&#x8C61;&#x4E0D;&#x540C;&#xFF0C;&#x8BF4;&#x6CD5;&#x4E5F;&#x4E0D;&#x540C;&#x4E86;&#x2026;&#x2026;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x60F3;&#x5230;&#x8BF7;&#x6C42;&#x4E0E;&#x54CD;&#x5E94;&#xFF0C;&#x54CD;&#x5E94;&#x56DE;&#x6765;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x8005;&#x628A;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x6309;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x6B65;&#x903B;&#x8F91;&#x64CD;&#x4F5C;&#xFF0C;&#x8F93;&#x51FA;&#x5230;&#x9875;&#x9762;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x6709;bug&#x7684;&#x56DE;&#x8DEF;&#xFF1A;&#x7528;&#x6237;&#x2192;&#x261E;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x8005;&#x2192;&#x261E;&#x540E;&#x7AEF;&#x5F00;&#x53D1;&#x8005;&#x2192;&#x261E;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x8005;&#x2192;&#x261E;&#x7528;&#x6237;&#x3002;&#x8FD9;&#x8BA9;&#x6211;&#x60F3;&#x8D77;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4E09;&#x5927;&#x539F;&#x5219;&#xFF1A;</p>
<blockquote>
<ol>
<li>&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x6267;&#x884C;&#x8F93;&#x5165;&#x3001;&#x8FD0;&#x7B97;&#x3001;&#x8F93;&#x51FA;&#x7684;&#x673A;&#x5668;</li>
<li>&#x7A0B;&#x5E8F;&#x662F;&#x6307;&#x4EE4;&#x548C;&#x6570;&#x636E;&#x7684;&#x96C6;&#x5408;</li>
<li>&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x6709;&#x65F6;&#x4E0E;&#x4EBA;&#x4EEC;&#x7684;&#x601D;&#x7EF4;&#x4E60;&#x60EF;&#x4E0D;&#x540C;</li>
</ol>
</blockquote>
<p>&#x2014;&#x2014;&#x6765;&#x81EA;&#x300C;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x600E;&#x6837;&#x8DD1;&#x8D77;&#x6765;&#x7684;&#x300D;&#x4E00;&#x4E66;</p>
<p>&#x4E00;&#x4E2A;&#x4E0D;&#x6070;&#x5F53;&#x7684;&#x6BD4;&#x55BB;&#xFF0C;&#x5C31;&#x5982;&#x5C0F;&#x65F6;&#x5019;&#x73A9;&#x7684;&#x6254;&#x6C99;&#x888B;&#x6E38;&#x620F;&#xFF0C;&#x7528;&#x6237;&#x662F;&#x6254;&#x6C99;&#x888B;&#x7684;&#x4EBA;&#xFF0C;&#x524D;&#x540E;&#x7AEF;&#x5F00;&#x53D1;&#x8005;&#x5219;&#x662F;&#x5728;&#x5708;&#x5708;&#x91CC;&#x5982;&#x4F55;&#x7075;&#x6D3B;&#x8EB2;&#x95EA;&#x98DE;&#x8FC7;&#x6765;&#x7684;&#x6C99;&#x888B;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x7528;&#x6237;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x662F;&#x8001;&#x5927;&#x2026;&#x2026;</p>
<p>&#x6269;&#x5C55;&#x9605;&#x8BFB;&#xFF1A;<a href="http://qkxue.net/info/131567/javascript-javascript" target="_blank">JavaScript&#x4E8B;&#x4EF6;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;</a>&#x3001;<a href="https://www.liaoxuefeng.com/wiki/001434446689867b27157e896e74d51a89c25cc8b43bdb3000/00143564690172894383ccd7ab64669b4971f4b03fa342d000" target="_blank">&#x4E8B;&#x4EF6;</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="序.html" class="navigation navigation-prev " aria-label="Previous page: 序">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="本书内容.html" class="navigation navigation-next " aria-label="Next page: 本书内容">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"前言","level":"1.4.2","depth":2,"next":{"title":"本书内容","level":"1.4.3","depth":2,"path":"A1-序+前言/本书内容.md","ref":"./A1-序+前言/本书内容.md","articles":[]},"previous":{"title":"序","level":"1.4.1","depth":2,"path":"A1-序+前言/序.md","ref":"./A1-序+前言/序.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-plus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search-plus":{},"highlight":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JavaScript高程3笔记","language":"zh-hans","gitbook":"3.2.3"},"file":{"path":"A1-序+前言/前言.md","mtime":"2018-08-14T09:07:25.200Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-15T05:48:00.797Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

